Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: The Unix permission C<rwxr-x---> is represented as three sets of three bits, or three octal digits: C<0750> (the leading 0 indicates octal and isn't one of the digits).
es_es: Los permisos Unix C<rwxr-x---> son representados como tres conjuntos de tres bits, o tres dígitos octales: C<0750> (el 0 precedente indica que es octal, y que no es uno de los dígitos).

source: Now, however, the order varies between different runs of Perl.
es_es: Ahora, sin embargo, el orden varía entre diferentes ejecuciones de Perl.

source: (This works on machines only for which the device number is negative under NFS.)
es_es: (Esto funciona solo en máquinas en las cuales el número de dispositivo es negativo para NFS)

source: ?: * zero or more /x ign.
es_es: ?: * cero o varios /x ign.

source: =head2 Threaded Perl on DG/UX
es_es: =head2 Perl con I<threads> en DG/UX

source: Line up corresponding things vertically, especially if it'd be too long to fit on one line anyway.
es_es: Alineé elementos correspondientes verticalmente, especialmente si es demasiado largo el espacio que ocupan como para entrar en una sola línea.

source: the C<< $COMPILING >> variable has been added
es_es: La variable C<< $COMPILING >> ha sido añadida

source: Given integer operands C<$a> and C<$b>: If C<$b> is positive, then C<$a % $b> is C<$a> minus the largest multiple of C<$b> less than or equal to C<$a>.
es_es: Dados los operandos enteros C<$a> y C<$b>: si C<$b> es positivo, entonces C<$a % $b> es C<$a> menos el mayor múltiplo de C<$b> menor o igual a C<$a>.

source: \1 [5] Backreference to a specific capture group or buffer.
es_es: \1 [5] Contrareferencia a un específico grupo de captura o búfer.

source: To subscribe, send an empty message to perl-mvs-subscribe@perl.org.
es_es: Para suscribirse, envíe un mensaje vacío a perl-mvs-subscribe@perl.org.

source: Returns the value of the last command in the sequence of commands indicated by BLOCK.
es_es: Devuelve el valor del último comando en la secuencia de comandos indicada por BLOQUE.

source: crypt() is a one-way hash function.
es_es: crypt() es una función hash de un sólo sentido.

source: open(STDOUT, '>', "foo.out") or die "Can't redirect STDOUT: $!";
es_es: open(STDOUT, '>', "foo.out") or die "No puedo redirigir STDOUT: $!";

source: If you want to run a threaded Perl on OpenBSD 3.7 or higher, you will need to upgrade to at least Perl 5.8.7.
es_es: Si quiere correr un Perl con hilos sobre OpenBSD 3.7 o superior, necesitará actualizar Perl al menos a la versión 5.8.7.

source: perlunitut Perl Unicode tutorial
es_es: perlunitut Tutorial de Unicode

source: Some programmers may prefer to think of filehandles as objects with methods, preferring to write the last example as:
es_es: Algunos programadores prefieren pensar en identificadores de archivo como objetos con métodos, prefiriendo escribir el último ejemplo como:

source: perl586delta Perl changes in version 5.8.6
es_es: perl586delta Cambios en la versión 5.8.6

source: The string is broken into chunks described by the TEMPLATE.
es_es: La cadena se rompe en trozos descritos por la PLANTILLA.

source: @new = sort { substr($a, 3, 5) cmp substr($b, 3, 5) } @old;
es_es: @nuevo = sort { substr($a, 3, 5) cmp substr($b, 3, 5) } @viejo;

source: =head2 state() variables
es_es: =head2 Variables state()

source: In list context, returns the value or values deleted, or the last such element in scalar context.
es_es: En contexto de lista, devuelve el valor o los valores borrados, o el último elemento de este tipo en contexto escalar.

source: This document describes differences between the 5.9.2 and the 5.9.3 development releases.
es_es: Este documento describe las diferencias entre las versiones de desarrollo 5.9.2 y la 5.9.3.

source: Watch out for this one, then, because an arrayref is always a true value, which makes it effectively redundant.
es_es: Tenga cuidado con esto, porque una referencia a un array es siempre un valor verdadero, lo que, efectivamente, es redundante.

source: This convention was adopted by the community, and the second edition became I<Programming Perl>, using the capitalized version of the name to refer to the language.
es_es: La comunidad adoptó esta convención y la segunda edición pasó a llamarse I<Programming Perl>, con la versión con inicial mayúscula en el nombre para referirse al lenguaje.

source: It's also very useful for creating skeletons of pure Perl modules.
es_es: También resulta muy útil para crear la estructura inicial de módulos Perl puros.

source: Two flag bits are currently supported.
es_es: Actualmente están soportados dos bit de esa bandera.

source: Note that Perl closes the comment as soon as it sees a C<)>, so there is no way to put a literal C<)> in the comment.
es_es: Tenga en cuenta que Perl cierra el comentario tan pronto como vea un C<)>, por lo que no hay manera de poner un C<)> literal en el comentario.

source: The default VERSION method, inherited from the UNIVERSAL class, croaks if the given version is larger than the value of the variable C<$Module::VERSION>.
es_es: El método VERSIÓN por defecto, heredado de la clase UNIVERSAL, croa si la versión dada es mayor que el valor de la variable C<$Módulo::VERSIÓN>.

source: =head2 Statement Modifiers X<statement modifier> X<modifier> X<if> X<unless> X<while> X<until> X<when> X<foreach> X<for>
es_es: =head2 Modificadores de instrucciones X<statement modifier> X<modifier> X<if> X<unless> X<while> X<until> X<when> X<foreach> X<for> X<modificador de instrucción> X<modificador>

source: Here's how a C programmer might code up a particular algorithm in Perl:
es_es: Aquí hay un ejemplo de cómo un programador de C codificaría un determinado algoritmo en Perl:

source: If you meant the empty regex, just use parentheses or spaces to disambiguate, or even prefix the empty regex with an C<m> (so C<//> becomes C<m//>).
es_es: Si usted quiere decir la expresión regular vacía, sólo tiene que utilizar paréntesis o espacios para eliminar la ambigüedad, o incluso el prefijar con una C<m> (así que C<//> se convierte en C<m//>).

source: This can be avoided if you always use O_NONBLOCK on the socket.
es_es: Esto puede evitarse si siempre utiliza O_NONBLOCK en el I<socket>.

source: In the description below C<S> and C<T> are regular subexpressions.
es_es: En la siguiente descripción C<S> y C<T> son subexpresiones regulares.

source: (The pseudo code above doesn't work because it treats <ARGV> as non-magical.)
es_es: (El pseudo código anterior no funciona porque trata a <ARGV> como no-mágico).

source: If you chomp a list, each element is chomped, and the total number of characters removed is returned.
es_es: Si recorta una lista, cada elemento es recortado y se devuelve el número total de caracteres eliminados.

source: \W [3] Match a non-"word" character
es_es: \W [3] Coincide con un carácter que no es de "palabra"

source: Use named parameters (a hash or hashref) when there are more than two parameters
es_es: Use parámetros nominados (un hash o referencia a un hash) cuando haya más de dos parámetros

source: Minor documentation enhancement
es_es: Mejora menor en la documentación

source: Steve Peters provided new C<*_set> macros and reworked the core to use these rather than assigning to macros in LVALUE context.
es_es: Steve Peters proporcionó nuevas macros C<*_set> y rediseñó el núcleo para utilizar éstas en lugar de asignar a macros en contexto de IVALOR.

source: This is also useful for applications emulating C<tail -f>.
es_es: Esto también es útil para aplicaciones que emulen C<tail -f>.

source: However, these answers may not suffice for managers who require a purchase order from a company whom they can sue should anything go awry.
es_es: Sin embargo, es posible que estos argumentos no basten para convencer a los jefes que siempre exigen un pedido de compra de una empresa a la que puedan demandar si algo sale mal.

source: The F<Porting> directory contains a grab bag of code and documentation intended to help porters work on Perl.
es_es: El directorio F<Porting> contiene un conjunto de fragmentos de código y documentación que pueden servir de ayuda a los mantenedores de Perl.

source: They are passed an argument like the other code references (even if they choose to ignore it).
es_es: Se les pasa un argumento como a otras referencias de código (incluso si deciden ignorarlo).

source: However, this behaviour is sometimes undesirable.
es_es: Sin embargo, este comportamiento es a veces indeseable.

source: (You can set C<$/> to use a different line terminator.) The command is executed each time the pseudo-literal is evaluated.
es_es: (Puede configurar C<$/> para utilizar un terminador de línea diferente). El comando es ejecutado cada vez que el pseudo-literal es evaluado.

source: sub my_sub {
es_es: sub mi_sub {

source: if (EXPR) BLOCK else BLOCK
es_es: if (EXPR) BLOQUE else BLOQUE

source: This operator is also handy for inverting a hash, although there are some caveats.
es_es: Este operador también es útil para invertir un hash, aunque existen algunas salvedades.

source: If SCALAR is of length zero, you can only use an OFFSET of 0.
es_es: Si ESCALAR es de longitud cero, sólo se puede utilizar un DESPLAZAMIENTO de 0.

source: A variable holds the undefined value (C<undef>) until it has been assigned a defined value, which is anything other than C<undef>.
es_es: Una variable almacena el valor indefinido (C<undef>) hasta que se le asigna un valor definido, que es cualquier otra cosa distinta de C<undef>.

source: These last until their block is exited, but may be passed back.
es_es: Estos últimos duran hasta que se sale de su bloque, pero puede ser traspasado.

source: This will only affect people who have a threaded perl 5.8.1, and compiled modules which use these calls, and now attempt to run the compiled modules with 5.8.2.
es_es: Esto sólo afectará a las personas que tienen un perl 5.8.1 multihilo, y los módulos compilados que utilizan estas llamadas, y ahora intenta ejecutar los módulos compilados con 5.8.2.

source: Described in L<perlthrtut> and L<threads>.
es_es: Se describe en L<perlthrtut> y L<threads>.

# $_ = 'a'; print $x," "; # prints 1a4
source: $_ = 'a'; print $x,"\n"; # prints 1a4
es_es: $_ = 'a'; print $x,"\n"; # imprime 1a4

source: The problem is that the vast majority of people weren't: for example in RedHat releases 8 and 9 the B<default> locale setting is UTF-8, so all RedHat users got UTF-8 filehandles, whether they wanted it or not.
es_es: El problema es que la gran mayoría de la gente no lo era: por ejemplo, en RedHat versiones 8 y 9, la configuración local B<por defecto> es UTF-8, por lo que todos los usuarios de RedHat obtenían identificadores de archivo UTF-8, lo quisieran o no.

source: This is a new warning, produced in situations such as this:
es_es: Esta es una nueva advertencia, en situaciones como ésta:

source: See the documentation of your operating system's I<open>(2) syscall to see which values and flag bits are available.
es_es: Consulte la documentación de la llamada del sistema I<open>(2) de su sistema operativo para ver qué valores y bits de bandera están disponibles.

source: [...] [1] Match a character according to the rules of the bracketed character class defined by the "...".
es_es: [...] [1] Busca un carácter de acuerdo a las reglas de la clase carácter definida por "...".

source: of prior m//g)
es_es: de la anterior m//g)

source: Returns a Boolean value telling whether EXPR has a value other than the undefined value C<undef>.
es_es: Devuelve un valor Booleano indicando si EXPR tiene un valor que no sea el valor indefinido C<undef>.

source: Identical in every respect to normal capturing parentheses C<()> but for the additional fact that the group can be referred to by name in various regular expression constructs (like C<\g{NAME}>) and can be accessed by name after a successful match via C<%+> or C<%->.
es_es: Idéntico en todos los aspectos respecto a la captura normal con paréntesis C<()> pero con el hecho adicional de que C<%+> o C<%-> pueden ser usados para referirse por nombre en distintas construcciones de expresiones regulares (como C<\g{NOMBRE}>) y puede ser accedido por nombre después de una coincidencia exitosa, con C<%+> o C<%->.

source: The return value replaces the value in C<$@>; i.e., as if C<< $@ = eval { $@->PROPAGATE(__FILE__, __LINE__) }; >> were called.
es_es: El valor de retorno reemplaza el valor en C<$@>; es decir, como si se ejecutara C<< $@ = eval { $@->PROPAGATE(__FILE__, __LINE__) }; >>.

source: open(my $log, ">>", "my.log") or die "Can't open my.log: $!";
es_es: open(my $registro, ">>", "mi.registro") or die "No se puede abrir mi.registro: $!";

source: C<< => >> doesn't quote compound identifiers, that contain double colons.
es_es: C<< => >> no entrecomilla identificadores compuestos, que contengan dos dobles puntos.

source: Perl 5.8.0 had accidentally broken the capability for users to define their own uppercase<->lowercase Unicode mappings (as advertised by the Camel).
es_es: Perl 5.8.0 había roto accidentalmente la capacidad de los usuarios de definir sus propias asignaciones mayúsculas <-> minúsculas en Unicode (como se indicaba en el libro del camello).

source: This is provided as a more readable version of C<if (!I<condition>)>.
es_es: Esto se proporciona como una versión más legible de C<if (!I<condición>)>.

source: The file must return true as the last statement to indicate successful execution of any initialization code, so it's customary to end such a file with C<1;> unless you're sure it'll return true otherwise.
es_es: El archivo debe devolver verdadero como última instrucción para indicar una ejecución exitosa de cualquier código de inicialización, por lo que es habitual a tal efecto que un archivo termine con un C<1;> a menos que esté seguro de que devolverá cierto, de otra manera.

source: The hash randomisation introduced with 5.8.1 has been amended.
es_es: La asignación al azar hash introducido con 5.8.1 ha sido modificado.

source: The state is passed in as C<$_[1]>.
es_es: El estado es pasado en C<$_[1]>.

source: B<WARNING:> These patterns are experimental and subject to change or removal in a future version of Perl.
es_es: B<ADVERTENCIA:> Estos patrones son experimentales y sujetos a cambio o eliminación en una futura versión de Perl.

source: # This is a comment
es_es: # Esto es un comentario

source: left &&
es_es: izquierda &&

source: See L<perlsub/"Private Variables via my()"> for details, and L<fields>, L<attributes>, and L<Attribute::Handlers>.
es_es: Ver L<perlsub/"Variables privadas vía my()"> para más detalles, y L<fields>, L<attributes>, y L<Attribute::Handlers>.

source: You can import symbolic mode constants (C<S_IF*>) and functions (C<S_IS*>) from the Fcntl module:
es_es: Puede importar constantes simbólicas (C<S_IF*>) y funciones (C<S_IS*>) desde el módulo Fcntl:

source: # scalar context
es_es: # contexto escalar

source: The innermost always has priority over any outer ones, and one applying to the whole expression has priority over any of the default settings that are described in the remainder of this section.
es_es: La parte más interior siempre tiene prioridad sobre cualquier otra externa, y la que se aplica a toda la expresión tiene prioridad sobre cualquiera de los ajustes por defecto que se describen en el resto de esta sección.

source: There is now a simple command line frontend to the CPAN.pm module called F<cpan>.
es_es: En la actualidad existe una interfaz de línea de comandos simple para el módulo CPAN.pm llamado F<cpan>.

source: See also L</chomp>.
es_es: Ver también L</chomp>.

source: In general, the source code of perl has been refactored, tied up, and optimized in many places.
es_es: En general, el código fuente de perl ha sido refactorizado, enlazado, y optimizado en muchos lugares.

source: document the new taint behaviour of exec LIST and system LIST
es_es: documentar el comportamiento del nuevo comportamiento de I<taint> de exec LISTA y system LISTA

source: Possessive quantifiers are equivalent to putting the item they are applied to inside of one of these constructs.
es_es: Cuantificadores posesivos son equivalentes a poner el elemento a los que se aplica, dentro de una de estas construcciones.

source: You can omit the EXPR, in which case nothing is undefined, but you still get an undefined value that you could, for instance, return from a subroutine, assign to a variable, or pass as a parameter.
es_es: Puede omitir la EXPR, en tal caso, nada queda indefinido, pero aún obtiene un valor indefinido que podría, por ejemplo, devolver de una subrutina, asignar a una variable, o pasar como un parámetro.

source: decimal string --> native floating point (*)
es_es: cadena decimal --> punto flotante nativo (*)

source: $search = 'while (<>) { study;';
es_es: $buscar = 'while (<>) { study;';

source: Additional two OPs are not added anymore into op tree for shift and pop calls without argument (when it works on C<@_>).
es_es: Dos OP adicionales ya no son añadidos en el árbol op para las llamadas shift y pop sin argumentos (cuando trabajan sobre C<@_>).

source: This change should only affect platform maintainers writing configuration hints files.
es_es: Este cambio sólo debe afectar a los mantenedores de la plataforma al escribir sugerencias en los archivos de configuración.

source: print $bar; # prints 20, as it refers to $Foo::bar
es_es: print $bar; # pinta 20, porque se refiere a $Foo::bar

source: Last update: Tue Apr 26 18:30:55 MDT 2011
es_es: Última actualización: Mar Abr 26 18:30:55 MDT 2011

source: right not
es_es: derecha not

source: S<[ B<-pna> ] [ B<-F>I<pattern> ] [ B<-l>[I<octal>] ] [ B<-0>[I<octal/hexadecimal>] ]>
es_es: S<[ B<-pna> ] [ B<-F>I<patrón> ] [ B<-l>[I<octal>] ] [ B<-0>[I<octal/hexadecimal>] ]>

source: perltrap Perl traps for the unwary
es_es: perltrap Trampas para los incautos

source: ISBN 978-0-596-00478-1 [1st edition March 2006]
es_es: ISBN 978-0-596-00478-1 [1ª edición - Marzo de 2006]

source: printf '<%-10.6x>', 1; # prints "<000001 >"
es_es: printf '<%-10.6x>', 1; # imprime "<000001 >"

source: However, an explicit empty brace (C<\x{}>) will not cause a warning (currently).
es_es: Sin embargo, una explícita pareja de llaves vacía (C<\x{}>) no provocará ninguna advertencia (actualmente).

source: The latest versions of perl have more bug fixes.
es_es: Las versiones más recientes de Perl incorporan más correcciones de errores.

source: In searching for C</\bfoo\b/>, only locations in C<$_> that contain C<f> will be looked at, because C<f> is rarer than C<o>.
es_es: En la búsqueda de C</\bfoo\b/>, los únicos lugares que serán examinados de C<$_> serán los que contengan una C<f>, debido a que C<f> es más rara que una C<o>.

source: perlform Perl formats
es_es: perlform Formatos

source: In general, if something strange has gone wrong with your program and you're not sure where you should look for help, try the B<-w> switch first.
es_es: Si sucede algo raro con el programa y no está seguro de dónde debe buscar ayuda, pruebe primero el modificador B<-w>.

source: Now it's time to print your data structure out.
es_es: Ahora es el momento de imprimir la estructura de datos.

source: my ($arrayref, $filename) = @_;
es_es: my ($arrayref, $archivo) = @_;

source: If this is not what you want, use C<\Q> to interpolate a variable literally.
es_es: Si no es esto lo que quiere, use C<\Q> para interpolar una variable literalmente.

source: =head1 AUTHOR
es_es: =head1 AUTOR

source: [.?!] # followed by a sentence ender
es_es: [.?!] # seguido por un terminador de sentencia

source: However, if there is no such group, it will take virtually forever on a long string.
es_es: Sin embargo, si no existe tal grupo, le tomará casi un tiempo infinito si la cadena es muy larga.

source: If the subroutine's prototype is C<($$)>, the elements to be compared are passed by reference in C<@_>, as for a normal subroutine.
es_es: Si el prototipo de la subrutina es C<($$)>, los elementos a ser comparados son pasados por referencia en C<@_>, como en una subrutina normal.

source: Since C<SIGINT> and C<SIGQUIT> are ignored during the execution of C<system>, if you expect your program to terminate on receipt of these signals you will need to arrange to do so yourself based on the return value.
es_es: Puesto que C<SIGINT> y C<SIGQUIT> son ignoradas durante la ejecución de C<system>, si espera que su programa termine a la recepción de estas señales tendrá que disponer lo necesario para hacerlo usted mismo en función del valor de retorno.

source: File::Find provides an example of this with its C<find(\&wanted, $dir)> syntax.
es_es: File::Find ofrece un ejemplo de esto con su sintaxis C<find(\&buscado, $dir)>.

source: # same thing in reversed order
es_es: # lo mismo, en orden inverso

source: In fact, C<(?!)> gets optimised into C<(*FAIL)> internally.
es_es: De hecho, C<(?!)> internamente está optimizado para ser C<(*FAIL)>.

source: If a filter has been installed with this method, it will be invoked every time you read a value from a DBM database.
es_es: Si se ha instalado un filtro con este método, se invocará cada vez que se lea un valor de una base de datos DBM.

source: Regexp::Copy was affected by this change.
es_es: Regexp::Copy se vio afectada por este cambio.

source: If you're running Perl on a system that distinguishes between text files and binary files, then you should check out L</binmode> for tips for dealing with this.
es_es: Si está usando Perl en un sistema que distingue entre archivos de texto y archivos binarios, entonces debería consultar L</binmode> para ver sugerencias para tratar con esto.

source: A new pragma, C<feature>, has been added; see above in L</"Core Enhancements">.
es_es: Un nuevo pragma, C<feature>, ha sido añadido; vea más arriba en L</"Mejoras principales">.

source: =head3 Decoding
es_es: =head3 Descodificación

source: # now case-insensitively
es_es: # ahora, independiente del tamaño de caja

source: =head2 New "Missing control char name in \c"
es_es: =head2 Nuevo "I<Missing control char name in \c>" (Falta nombre de carácter de control en \c)

source: To be safe, you may need to set C<$|> ($AUTOFLUSH in English) or call the C<autoflush()> method of C<IO::Handle> on any open handles to avoid lost output.
es_es: Para estar seguros, puede necesitar poner C<$|> ($AUTOFLUSH en el módulo English) o llamar el método C<autoflush()> de C<IO::Handle> en cualquiera de los identificadores de archivo abiertos para evitar la pérdida de datos en la salida.

source: Especially troublesome has been the feature that before a "=>" a version string (a "v" followed by digits) has been interpreted as a v-string instead of a string literal.
es_es: Especialmente preocupante ha sido la característica de que antes de un "=>", una cadena de versión (una "v" seguida de dígitos) se ha interpretado como un v-string en lugar de una cadena literal.

source: C<$Config{longlongsize}> is undefined on systems without long long support.
es_es: C<$Config{longlongsize}> es indefinido en sistemas sin soporte de long largo.

source: While none of the built-in data types have any arbitrary size limits (apart from memory size), there are still a few arbitrary limits: a given variable name may not be longer than 251 characters.
es_es: Aunque ninguno de los tipos de datos integrados tiene un límite de tamaño (aparte del tamaño de la memoria disponible), hay algunos límites arbitrarios. Por ejemplo, un nombre de variable no puede tener más de 251 caracteres.
